2016/06/01/kernel_build_linux_for_qemu/index.html
<!DOCTYPE html>
<html>
  <head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" />
<!--[if lte IE 9]><meta http-equiv="refresh" content="0;url=/warn.html"><![endif]-->

<title>用 qemu-arm 构建内核开发环境</title>
<meta name="author" content="杜亚辉">

<meta name="keywords" content="undefined">

<meta name="description " content="记录生活 技术 心情">

<link rel="icon" href="/images/favicon.png">

<link rel="stylesheet" href="/css/style.css">

  </head>
  <body>
    <aside id="sidebar">
  <nav id="tags">
    <a href="http://thisisadu.github.io" id="avatar" style="background-image:url(/images/favicon.png)"></a>
    <ul id="tags__ul">
      <li id="pl__all" class="tags__li tags-btn active">所有文章</li>
      
      <li id="内核" class="tags__li tags-btn">内核</li>
      
    </ul>
    <div id="tags__bottom">
      <a href="http://github.com/thisisadu" rel="nofollow" id="icon-github" target="_blank" class="tags-btn fontello"></a>
      <a href="mailto:877904574@qq.com" rel="nofollow" id="icon-qq" target="_blank" class="tags-btn fontello"></a>
    </div>
  </nav> <!-- end #tags -->
  <div id="posts-list">
    <form action="#" id="search-form" target="_blank">
      <a href="/" id="mobile-avatar" style="background-image:url(/images/favicon.png)"></a>
      <input id="search-input" type="text" placeholder="戳这里搜索" />
    </form>
    <nav id="pl__container">
      
            
                <a class="内核 pl__all" href="/2016/06/01/kernel_build_linux_for_qemu/" title="用 qemu-arm 构建内核开发环境">
                  <span class="pl__circle"></span><span class="pl__title">用 qemu-arm 构建内核开发环境</span><span class="pl__date">2016-06-01</span>
                </a>
            
      
    </nav>
  </div> <!-- end #posts-list -->
</aside> <!-- end #sidebar -->

    <div id="post">
      <div id="pjax">
        <article id="post__content">
  <h1 id="post__title" data-identifier="2016-06-01">用 qemu-arm 构建内核开发环境</h1>
  <p>
&#x672C;&#x6587;&#x4E3A;&#x539F;&#x521B;&#x5185;&#x5BB9;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;&#xFF0C;&#x8C22;&#x8C22;
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> &#x51C6;&#x5907;&#x6784;&#x5EFA;&#x73AF;&#x5883;</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> &#x5B89;&#x88C5;&#x4EA4;&#x53C9;&#x7F16;&#x8BD1;&#x5668;</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
sudo apt-get install gcc-arm-linux-gnueabi
</pre>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> &#x5B89;&#x88C5; qemu-arm &#x6A21;&#x62DF;&#x5668;</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
sudo apt-get install qemu-system-arm
</pre>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> &#x521B;&#x5EFA;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
mkdir work 

cd work
</pre>
<p>
work &#x662F;&#x968F;&#x4FBF;&#x8D77;&#x7684;&#x540D;&#x5B57;,&#x4F60;&#x53EF;&#x4EE5;&#x8D77;&#x4F60;&#x559C;&#x6B22;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x6587;&#x7AE0;&#x4E0B;&#x6587;&#x52A8;&#x4F5C;&#x5047;&#x5B9A;&#x53D1;&#x751F;&#x5728;&#x8BE5;&#x76EE;&#x5F55;
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> &#x4E0B;&#x8F7D;&#x5E76;&#x89E3;&#x538B; linux &#x6E90;&#x7801;</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
wget https://cdn.kernel.org/pub/linux/kernel/v4.x/linux-4.6.tar.xz

tar xvf linux-4.6.tar.xz
</pre>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> &#x4E0B;&#x8F7D;&#x5E76;&#x89E3;&#x538B; busybox &#x6E90;&#x7801;</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
wget https://busybox.net/downloads/busybox-1.24.2.tar.bz2

tar xvf busybox-1.24.2.tar.bz2
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> &#x7F16;&#x8BD1;&#x5185;&#x6838;</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> &#x914D;&#x7F6E;&#x5185;&#x6838;</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
cd linux-4.6

make CROSS_COMPILE=arm-linux-gnueabi- ARCH=arm vexpress_defconfig
</pre>
<p>
vexpress &#x662F; qemu &#x652F;&#x6301;&#x6A21;&#x62DF;&#x7684;&#x4E00;&#x79CD;&#x5F00;&#x53D1;&#x677F;&#xFF0C;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x8BE5;&#x5E73;&#x53F0;&#x7F16;&#x8BD1;&#x5185;&#x6838;
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> &#x7F16;&#x8BD1;&#x5185;&#x6838;</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
make CROSS_COMPILE=arm-linux-gnueabi- ARCH=arm
</pre>
<p>
&#x7F16;&#x8BD1;&#x6839;&#x636E;&#x673A;&#x5668;&#x6027;&#x80FD;&#x4F1A;&#x8017;&#x8D39;&#x51E0;&#x5206;&#x949F;&#x5230;&#x51E0;&#x5341;&#x5206;&#x949F;&#x4E0D;&#x7B49;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B; 20 &#x5206;&#x949F;&#x5185;&#x80FD;&#x7F16;&#x8BD1;&#x5B8C;&#x6210;&#xFF0C;&#x8BF7;&#x8010;&#x5FC3;&#x7B49;&#x5F85;
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> &#x62F7;&#x8D1D;&#x955C;&#x50CF;</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
cd ..

cp linux-4.6/arch/arm/boot/zImage .

cp linux-4.6/arch/arm/boot/dts/vexpress-v2p-ca9.dtb .
</pre>
<p>
zImage &#x4E3A;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x5185;&#x6838;&#x955C;&#x50CF;,vexpress-v2p-ca9.dtb &#x4E3A;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x8BBE;&#x5907;&#x6811;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> &#x7F16;&#x8BD1; busybox</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> &#x914D;&#x7F6E; busybox</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
cd busybox-1.24.2

make defconfig

make menuconfig 
&#x8FDB;&#x5165;&#x83DC;&#x5355; Busybox Settings -&gt; Build Options -&gt; Build BusyBox as a static binary &#x9009;&#x4E2D;&#x5E76;&#x4FDD;&#x5B58;
</pre>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> &#x7F16;&#x8BD1; busybox</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
make CROSS_COMPILE=arm-linux-gnueabi-
</pre>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> &#x5B89;&#x88C5; busybox</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
sudo make CROSS_COMPILE=arm-linux-gnueabi- install
</pre>
<p>
&#x8FD9;&#x91CC;&#x7528; sudo &#x5B89;&#x88C5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x4F7F;&#x5B89;&#x88C5;&#x7684;&#x6587;&#x4EF6;&#x5C5E;&#x4E3B;&#x4E3A; root&#xFF0C;busybox &#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x7A0B;&#x5E8F;&#x5B89;&#x88C5;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684;_install &#x76EE;&#x5F55;&#x4E0B;
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> &#x5236;&#x4F5C;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> &#x751F;&#x6210;&#x5E76;&#x683C;&#x5F0F;&#x5316;&#x955C;&#x50CF;</h3>
<div class="outline-text-3" id="text-4-1">
<p>
&#x8BF7;&#x786E;&#x4FDD;&#x5728; work &#x6839;&#x76EE;&#x5F55;&#xFF0C;&#x540E;&#x8FB9;&#x4E0D;&#x5728;&#x8D58;&#x8FF0;
</p>
<pre class="example">
dd if=/dev/zero of=rootfs.img bs=1M count=30

mkfs.ext4 rootfs.img
</pre>
<p>
&#x7528; dd &#x547D;&#x4EE4;&#x751F;&#x6210;&#x4E00;&#x4E2A; 30M &#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x683C;&#x5F0F;&#x5316;&#x6210; ext4 &#x683C;&#x5F0F;&#xFF0C;&#x6709;&#x4E9B;&#x7CFB;&#x7EDF; mkfs.ext4 &#x547D;&#x4EE4;&#x53EF;&#x80FD;&#x5728;/sbin/&#x76EE;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x627E;&#x4E0D;&#x5230; mkfs.ext4 &#x547D;&#x4EE4;&#x65F6;&#x8BF7;&#x7528;/sbin/mkfs.ext4 &#x5F15;&#x7528;&#x5168;&#x8DEF;&#x5F84;
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> &#x521B;&#x5EFA;&#x4E34;&#x65F6;&#x76EE;&#x5F55;&#x5E76;&#x6302;&#x8F7D;&#x955C;&#x50CF;</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
mkdir tmp

sudo mount -o loop rootfs.img tmp
</pre>
<p>
&#x5C06;&#x521B;&#x5EFA;&#x7684;&#x955C;&#x50CF;&#x6587;&#x4EF6;&#x6302;&#x8F7D;&#x5230; tmp &#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5F80;&#x91CC;&#x9762;&#x5B58;&#x53D6;&#x6587;&#x4EF6;
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> &#x590D;&#x5236; busybox &#x6587;&#x4EF6;</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">
sudo cp -ar busybox-1.24.2/_install/* tmp
</pre>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> &#x5728;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5185;&#x521B;&#x5EFA;&#x5FC5;&#x8981;&#x7684;&#x76EE;&#x5F55;</h3>
<div class="outline-text-3" id="text-4-4">
<pre class="example">
cd tmp

sudo mkdir -p lib proc sys dev etc/init.d

cd ..
</pre>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> &#x590D;&#x5236;&#x7CFB;&#x7EDF; c &#x8FD0;&#x884C;&#x65F6;&#x5E93;</h3>
<div class="outline-text-3" id="text-4-5">
<pre class="example">
sudo cp -ar /usr/arm-linux-gnueabi/lib/* tmp/lib
</pre>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> &#x521B;&#x5EFA;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#x811A;&#x672C;</h3>
<div class="outline-text-3" id="text-4-6">
<pre class="example">
sudo vi tmp/etc/init.d/rcS

&#x8F93;&#x5165;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x5E76;&#x4FDD;&#x5B58;
#!/bin/sh
mount -t proc none /proc
mount -t sysfs none /sys
mount -t devtmpfs none /dev
mdev -s
</pre>
<p>
&#x8FD9;&#x91CC;&#x8981;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF0C;tmp &#x76EE;&#x5F55;&#x4E0B;&#x7684; linuxrc &#x4E3A;&#x5185;&#x6838;&#x9ED8;&#x8BA4;&#x6267;&#x884C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x53C8;&#x4F1A;&#x9ED8;&#x8BA4;&#x53BB;&#x6267;&#x884C; etc/init.d/rcS&#xFF0C;&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x7CFB;&#x7EDF;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x8981;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;
&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4EC5;&#x4EC5;&#x6302;&#x8F7D;&#x91CC;&#x51E0;&#x4E2A;&#x7CFB;&#x7EDF;&#x5173;&#x952E;&#x7684;&#x865A;&#x62DF;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5E76;&#x542F;&#x52A8; mdev &#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;
</p>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> &#x5378;&#x8F7D;&#x955C;&#x50CF;&#xFF08;&#x53EF;&#x7565;&#x8FC7;&#xFF09;</h3>
<div class="outline-text-3" id="text-4-7">
<pre class="example">
sudo umount tmp
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> &#x7528;&#x6A21;&#x62DF;&#x5668;&#x542F;&#x52A8;&#x7CFB;&#x7EDF;</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> &#x5199;&#x542F;&#x52A8;&#x811A;&#x672C;</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="example">
vi run.sh

&#x8F93;&#x5165;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x5E76;&#x4FDD;&#x5B58;
#!/bin/sh
qemu-system-arm -M vexpress-a9 -m 512M -kernel zImage -dtb vexpress-v2p-ca9.dtb -sd rootfs.img -nographic -append &quot;root=/dev/mmcblk0 console=ttyAMA0&quot;

&#x6DFB;&#x52A0;&#x6267;&#x884C;&#x6743;&#x9650;
chmod +x run.sh
</pre>
<p>
&#x4E4B;&#x6240;&#x4EE5;&#x5236;&#x4F5C;&#x811A;&#x672C;&#x542F;&#x52A8;&#xFF0C;&#x662F;&#x7531;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x53C2;&#x6570;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4E0D;&#x60F3;&#x6BCF;&#x6B21;&#x8F93;&#x5165;
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> &#x542F;&#x52A8;&#x7CFB;&#x7EDF;</h3>
<div class="outline-text-3" id="text-5-2">
<pre class="example">
./run.sh
</pre>
<p>
&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x7528; qemu &#x865A;&#x62DF;&#x673A;&#x6765;&#x542F;&#x52A8;&#x81EA;&#x5DF1;&#x7F16;&#x8BD1;&#x7684;&#x5185;&#x6838;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x5982;&#x679C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5185;&#x6838;&#x6216;&#x8005;&#x9A71;&#x52A8;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x5185;&#x6838;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x6210;&#x6A21;&#x5757;&#x653E;&#x5230;&#x6839;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5185;&#x5373;&#x53EF;&#xFF0C;&#x795D;&#x6109;&#x5FEB;&#xFF01;
</p>
</div>
</div>
</div>

</article>
<button id="js-fullscreen"><span id="icon-arrow" class="fontello"></span></button>
<script src="/js/js-lib.js" type="text/javascript"></script>

  <link rel="stylesheet" type="text/css" href="/css/codeStyle/xcode.css" />
  <script src="/js/highlight.pack.js" type="text/javascript"></script>


  <div id="post__action">
      <a id="icon-heart" class="fontello" href="javascript:donate();"></a>
  </div>
  <script src="/layer/layer.js" type="text/javascript"></script>
  <script src="/layer/extend/layer.ext.js" type="text/javascript"></script>


<!-- 多说评论框 start -->
<div class="ds-thread" data-thread-key="undefined" data-title="用 qemu-arm 构建内核开发环境" data-url="http://thisisadu.github.io/2016/06/01/kernel_build_linux_for_qemu/"></div>
<!-- 多说评论框 end -->
<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
var duoshuoQuery = {short_name:"thisisadu"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0]
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- 多说公共JS代码 end -->

        <p id="copyright">由<a href="http://hexo.io" target="_blank">Hexo</a>生成页面&nbsp;&nbsp;|&nbsp;&nbsp;由<a href="https://github.com/tangkunyin/hexo-theme-ttstyle" target="_blank">TTStyle</a>提供主题&nbsp;&nbsp;|&nbsp;&nbsp;由<a href="http://github.com" target="_blank">Github</a>提供托管&nbsp;&nbsp;|&nbsp;&nbsp;由<a href="http://duoshuo.com" target="_blank">多说</a>提供评论&nbsp;&nbsp;|&nbsp;&nbsp;由<a href="http://tongji.baidu.com" target="_blank">百度</a>提供统计</p>
<!-- 百度统计 -->
<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?49d15554ab254ca77ce19a07a620604d";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>

      </div>
    </div>
  </body>
</html>
